# AddVertices Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
VertexStreamPositionColored..::..AddVertices Method
VertexStreamPositionColored Class See Also
---
Inserts multiple VertexStreamPositionColored instances into the stream and associated buffer.
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public void AddVertices(
	IList<VertexPositionColored> vertices
)
```

Visual Basic
---
```text
Public Sub AddVertices ( _
	vertices As IList(Of VertexPositionColored) _
)
```

Visual C++
---
```text
public:
void AddVertices(
	IList<VertexPositionColored^>^ vertices
)
```

# ### Parameters
vertices
    Type: System.Collections.Generic..::..IList<(Of <(<'VertexPositionColored>)>)> The vertices to be inserted.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown if the associated buffer is not mapped. -or- Thrown if the associated buffer has insufficient space. |

# See Also
VertexStreamPositionColored Class
Autodesk.Revit.DB.DirectContext3D Namespace